{
    "bullet_points": [
        "In this video, we're going to cover some basic concepts such as displacement, velocity, acceleration, projectile motion, Newton's three laws, forces, momentum, and things like that. So, for those of you who want a basic intro into physics and just want to understand some principle ideas involved in physics, this video is for you. Now, many of you out there are very familiar with the word distance. I think of how far something has traveled. So, let's say if you have a person, let's say John, and he's at this position right here, and he decides to walk, let's say,  meters east, and then he turns in the other direction and travels, let's say,  meters west. So now he's at position eight on a number line. Now, displacement has magnitude and direction. Anytime you go TOWArds the right, you're going in the positive x direction. Now, during the second part of the trip, he's traveling west, that is, towards the negative x direction. If you're TRavElinG west or south, displacement has a negative value. So if I say you traveled  miles, am I describing distance or displacement? So you could be going east, west, north, or south. If you simply state  miles, you're describing distance. It only has magnitude such as  miles without any direction. A scalar quantity, as we said before, has magnitude only, but a vector quantity has magnitude and direction. Speed tells you how fast something is moving. So let's say this is the starting line, and I'm going to use a box to represent a car, and the car is moving in this direction with a speed of  meterssecond so  second later, the car will have traveled a total distance of  meters. So every hour you're going to travel an additional distance of  miles. Speed is a scalar quantity and velocity is a vector quantity. And so velocity is basically speed with direction. So remember, velocity is speed with direction. So if v is negative  meterssecond you're dealing with velocity because it's negative. If you're LOOking for the speed, the speed would be positive  meterssecond speed is always positive. Now, if you think about this formula, d is equal to vt. V can be described as the speed or the velocity. Average velocity could be represented by v, displacement can be represented by d, and the time is t. So the formula looks identical, but the meaning is different. Velocity is associated with displacement. And from position b to position c,  meters. Now keep in mind you can also treat this as a number line. And the difference between these two positions will be the net displacement, which is still negative eight. Because anytime you're going in the west direction towards the negative x axis, it will be negative. A good way to think about it is imagine two vehicles, let's say a truck. Acceleration is defined as the change in velocity divided by the change in time. That's the change in velocity divided by  seconds. Can see, the acceleration of the sports car is much greater than the acceleration of the truck. Let's say if an object is moving with an initial speed of  meterssecond so V o tells you initial speed or initial velocity. So if we make a tablE, if we plot time and velocity, let's say the final velocity at a certain time at t equals zero, this becomes the initial velocity. So anytime acceleration is positive, the velocity is increasing. Anytime the acceleration is negative, the velocity is decreasing. Is this object speeding up or slowing down? And remember, speed is the absolute value of velocity. Now,  second later, what will be the new velocity? So, as you can see, it's speeding up because the speed is increasing after  seconds. That is, if they're both positive or both negative. So make sure you understand that concept. In physics, you'll see this symbol that looks like a G, and it's equal to negative . And so the fact that this gravitational acceleration is negative means that it will always decrease the velocity. The gravitational acceleration does not AFFECT Vx. So TECHNICALLY, you can write this as GY. It's a vertical gravitational acceleration. Now, let's use an example to help us understand gy. Gravity is going to cause the ball to fall. So let's say we have a similar situation. We have the same person with the ball in his hand, and this time he throws it in the upward direction with an initial speed of . So when the vertical velocity is at zero, that means that it's no longer going up anymore and it's not going down yet. So it took  seconds to get to its maximum height. So now you understand what's happening to the velocity values as time progresses. The second case was the ball going up and then down. So one example that you'll see is a ball being kicked off a cliff or rolling off a cliff. So if you look at the traJectory, this line is only going to the right. Let's say where t is two,  seconds,  second later, we know what vy is going to be due to gravitational acceleration, the vertical velocity will decrease by . So  second later, what's going to happen to Vx and vy? It's still  meterssecond but now it's going down. So there's symmetry for this type of shape. and that's a negative .. So the velocities just have opposite signs, but speed, in either case, is still positive .. So the speed is the same when the height is the same, but Vx doesn't change. Now, let's talk about Newton's three laws. So in this case, the force is pushing the box towards the right. The only way to stop the box from moving in this direction is to apply a force in the opposite direction. An object in motion will continue in motion unless acted on by a force. The mass is , going to be  divided by ten, which is eight."
    ]
}